# Project 3 - Part 3
- Clint Atterberry
- 9/9/22

## **Business Problem**

*For this project, you have been hired to produce a MySQL database on Movies from a subset of IMDB's publicly available dataset. Ultimately, you will use this database to analyze what makes a movie successful, and will provide recommendations to the stakeholder on how to make a successful movie.*

## **Part 3**

***For part 3 of the project you will be practicing applying an E.T.L process on your previously saved movie data. Specifically, you will create a new MySQL database after preparing the data for a relational database.  You will export your database to a .sql file in your repository using MySQL Workbench.***

**Specifications - Database**
- **Your stakeholder wants you to take the data you have been cleaning and collecting in Parts 1 & 2 of the project, and wants you to create a MySQL database for them.**
- You should normalize the tables as best you can before adding them to your new database.
    - Note: an important exception to their request is that they would like you to keep all of the data from the TMDB API in 1 table together (even though it will not be perfectly normalized).  
    - You only need to keep the imdb_id, revenue, budget, and certification columns
**Required Transformation steps:**
- **Normalize Genre:**
    - Convert the single string of genres from title basics into 2 new tables.
    1. ```title_genres:``` with the columns:
        - tconst
        - genre_id
    2. ```genres:```
        - genre_id
        - genre_name
- **Discard unnecessary information:**
    - For the ```title basics``` table, drop the following columns:
        - "original_title" (we will use the primary title column instead)
        - "isAdult" ("Adult" will show up in the genres so this is redundant information).
        - "titleType" (every row will be a movie).
        - "genres" and other variants of genre (genre is now represented in the 2 new tables described above.
    - Do not include the ```title_akas``` table in your SQL database.
        - You have already filtered out the desired movies using this table and the remaining data is mostly nulls and not of-interest to the stakeholder.
**MySQL Database Requirements**
- Use sqlalchemy with pandas to execute your SQL queries inside your notebook.

- Create a new database on your MySQL server and call it "movies".

- Make sure to have the following tables in your "movies" database:

    - ```title_basics```
    - ```title_ratings```
    - ```title_genres```
    - ```genres```
    - ```tmdb_data```
- Make sure to set a Primary Key for each table that isn't a joiner table (e.g. title_genres is a joiner table).
- After creating each table, show the first 5 rows of that table using a SQL query.
- Make sure to run the "SHOW TABLES" SQL query at the end of your notebook to show that all required tables have been created.

**Deliverables**

Submit a link to your github respository containing the Jupyter Notebook file.

# Setup

In [44]:
# Standard Imports
import pandas as pd

# Additional Imports
import json
import tmdbsimple as tmdb
from tqdm.notebook import tqdm_notebook
from sqlalchemy import create_engine
from sqlalchemy_utils import create_database, database_exists
from sqlalchemy.types import String,Integer,Text,Float

In [45]:
import pymysql
pymysql.install_as_MySQLdb()

In [46]:
# load login keys
with open('/Users/oneda/.secret/movie_api.json', 'r') as f:
    login = json.load(f)
## Display the keys of the loaded dict
login.keys()

dict_keys(['client-id', 'api-key'])

In [47]:
# load data
df = pd.read_csv('Data/title_basics.csv.gz', low_memory=False)
print(f'Title Basics:\n{df.head(2)}\n\n')

Title Basics:
      tconst titleType                                       primaryTitle  \
0  tt0035423     movie                                     Kate & Leopold
1  tt0062336     movie  The Tango of the Widower and Its Distorting Mi...

                               originalTitle  isAdult  startYear  endYear  \
0                             Kate & Leopold        0       2001      NaN
1  El Tango del Viudo y Su Espejo Deformante        0       2020      NaN

   runtimeMinutes                  genres
0             118  Comedy,Fantasy,Romance
1              70                   Drama

# Transformation

## Prep DateFrame

In [48]:
## create a col with a list of genres
df['genres_split'] = df['genres'].str.split(',')
df.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance","[Comedy, Fantasy, Romance]"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El Tango del Viudo y Su Espejo Deformante,0,2020,NaN,70,Drama,[Drama]
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018,NaN,122,Drama,[Drama]
3,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005,NaN,100,"Comedy,Horror,Sci-Fi","[Comedy, Horror, Sci-Fi]"
4,tt0094859,movie,Chief Zabu,Chief Zabu,0,2016,NaN,74,Comedy,[Comedy]

In [49]:
# explode genres_split
exploded_genres = df.explode('genres_split')
exploded_genres

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance",Comedy
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance",Fantasy
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance",Romance
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El Tango del Viudo y Su Espejo Deformante,0,2020,NaN,70,Drama,Drama
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018,NaN,122,Drama,Drama
...,...,...,...,...,...,...,...,...,...,...
79643,tt9916190,movie,Safeguard,Safeguard,0,2020,NaN,95,"Action,Adventure,Thriller",Action
79643,tt9916190,movie,Safeguard,Safeguard,0,2020,NaN,95,"Action,Adventure,Thriller",Adventure
79643,tt9916190,movie,Safeguard,Safeguard,0,2020,NaN,95,"Action,Adventure,Thriller",Thriller
79644,tt9916362,movie,Coven,Akelarre,0,2020,NaN,92,"Drama,History",Drama
79644,tt9916362,movie,Coven,Akelarre,0,2020,NaN,92,"Drama,History",History

In [50]:
# save a new list called 'unique_genres'
unique_genres = sorted(exploded_genres['genres_split'].unique())

## Create new table

In [51]:
# save just the tconst and genres_split as new df
title_genres = exploded_genres[['tconst','genres_split']].copy()
title_genres.head()

      tconst genres_split
0  tt0035423       Comedy
0  tt0035423      Fantasy
0  tt0035423      Romance
1  tt0062336        Drama
2  tt0069049        Drama

## Create a Genre Mapper Dictionary

In [52]:
## Making the genre mapper dictionary
genre_ints = range(len(unique_genres))
genre_map = dict(zip(unique_genres, genre_ints))
genre_map

{'Action': 0,
 'Adult': 1,
 'Adventure': 2,
 'Animation': 3,
 'Biography': 4,
 'Comedy': 5,
 'Crime': 6,
 'Drama': 7,
 'Family': 8,
 'Fantasy': 9,
 'Game-Show': 10,
 'History': 11,
 'Horror': 12,
 'Music': 13,
 'Musical': 14,
 'Mystery': 15,
 'News': 16,
 'Reality-TV': 17,
 'Romance': 18,
 'Sci-Fi': 19,
 'Short': 20,
 'Sport': 21,
 'Talk-Show': 22,
 'Thriller': 23,
 'War': 24,
 'Western': 25}

## Replace string genres

In [53]:
## make new integer genre_id and drop string genres
title_genres['genre_id'] = title_genres['genres_split'].map(genre_map)
title_genres = title_genres.drop(columns='genres_split')

In [54]:
title_genres

          tconst  genre_id
0      tt0035423         5
0      tt0035423         9
0      tt0035423        18
1      tt0062336         7
2      tt0069049         7
...          ...       ...
79643  tt9916190         0
79643  tt9916190         2
79643  tt9916190        23
79644  tt9916362         7
79644  tt9916362        11

[149102 rows x 2 columns]

## Convert the Genre Map

In [55]:
## Manually make DataFrame with named cols from the .keyd and .values
genre_lookup = pd.DataFrame({'genre_name': genre_map.keys(),
                            'genre_id': genre_map.values()})
genre_lookup.head()

  genre_name  genre_id
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4

## Drop Columns

In [56]:
# Drop columns
discard_cols = ['originalTitle','isAdult','titleType','genres','genres_split']
df.drop(columns=discard_cols, inplace=True)
df.columns

Index(['tconst', 'primaryTitle', 'startYear', 'endYear', 'runtimeMinutes'], dtype='object')

# MySQL Tables

## Saving as Primary Key

### df

In [57]:
# check column dtypes
df.dtypes

tconst             object
primaryTitle       object
startYear           int64
endYear           float64
runtimeMinutes      int64
dtype: object

In [58]:
## calcluate max string lengths
key_len = df['tconst'].fillna('').map(len).max()
title_len = df['primaryTitle'].fillna('').map(len).max()

# create dictionary using {'col_name': dtype}
df_schema = {
    'tconst': String(key_len+1),
    'primaryTitle': Text(title_len+1),
    'startYear': Integer(),
    'endYear': Float(),
    'runtimeMinutes': Integer()}

In [59]:
df_schema

{'tconst': String(length=11),
 'primaryTitle': Text(length=243),
 'startYear': Integer(),
 'endYear': Float(),
 'runtimeMinutes': Integer()}

### tmdb

In [60]:
# read in tmdb results
tmdb_df = pd.read_csv('Data/tmdb_results_combined.csv.gz')
tmdb_df = tmdb_df[['imdb_id','revenue','budget','certification']]
tmdb_df.head()

     imdb_id      revenue       budget certification
0  tt0118694   12854953.0     150000.0            PG
1  tt0120467      14904.0     120000.0             R
2  tt0120630  224834564.0   45000000.0             G
3  tt0120753     105983.0    8000000.0             R
4  tt0120755  546388105.0  125000000.0         PG-13

In [61]:
tmdb_df.dtypes

imdb_id           object
revenue          float64
budget           float64
certification     object
dtype: object

In [62]:
## calcluate max string lengths
key_len = tmdb_df['imdb_id'].fillna('').map(len).max()
title_len = tmdb_df['certification'].fillna('').map(len).max()

# create dictionary using {'col_name': dtype}
tmdb_schema = {
    'imdb_id': String(key_len+1),
    'revenue': Float(),
    'budget': Float(),
    'certification': Text(title_len+1)}

In [63]:
tmdb_schema

{'imdb_id': String(length=10),
 'revenue': Float(),
 'budget': Float(),
 'certification': Text(length=6)}

### ratings

In [64]:
# read in title_ratings
ratings_df = pd.read_csv('Data/title_ratings.csv.gz')
ratings_df.head()

      tconst  averageRating  numVotes
0  tt0000001            5.7      1905
1  tt0000002            5.8       256
2  tt0000003            6.5      1705
3  tt0000004            5.6       168
4  tt0000005            6.2      2519

In [65]:
ratings_df.dtypes

tconst            object
averageRating    float64
numVotes           int64
dtype: object

In [66]:
## calcluate max string lengths
key_len = ratings_df['tconst'].fillna('').map(len).max()

# create dictionary using {'col_name': dtype}
ratings_schema = {
    'tconst': String(key_len+1),
    'averageRating': Float(),
    'numVotes': Integer()}

In [67]:
ratings_schema

{'tconst': String(length=11), 'averageRating': Float(), 'numVotes': Integer()}

## Create Tables

### Setup

In [68]:
# create engine
connection_str = "mysql+pymysql://root:root@localhost/movies"
engine = create_engine(connection_str)

In [69]:
## Check if database exists, if not, create it
if database_exists(connection_str) == False: create_database(connection_str)
else: print('The database already exists.')

The database already exists.

In [70]:
# check if database exists
database_exists(connection_str)

True

### to_sql

In [71]:
# df
df.to_sql('title_basics', engine, dtype=df_schema, if_exists='replace',index=False)

q ="""
SELECT *
FROM title_basics
LIMIT 5;
"""

pd.read_sql(q, engine)

,tconst,primaryTitle,startYear,endYear,runtimeMinutes
0,tt0035423,Kate & Leopold,2001,None,118
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020,None,70
2,tt0069049,The Other Side of the Wind,2018,None,122
3,tt0088751,The Naked Monster,2005,None,100
4,tt0094859,Chief Zabu,2016,None,74

In [72]:
# genre_lookup
genre_lookup.to_sql('genre_lookup', engine, if_exists='replace',index=False)

q ="""
SELECT *
FROM genre_lookup
LIMIT 5;
"""

pd.read_sql(q, engine)

  genre_name  genre_id
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4

In [73]:
# title_genres
title_genres.to_sql('title_genres', engine, if_exists='replace',index=False)

q ="""
SELECT *
FROM title_genres
LIMIT 5;
"""

pd.read_sql(q, engine)

      tconst  genre_id
0  tt0035423         5
1  tt0035423         9
2  tt0035423        18
3  tt0062336         7
4  tt0069049         7

In [74]:
# tmdb
tmdb_df.to_sql('tmdb', engine, dtype=tmdb_schema, if_exists='replace',index=False)

q ="""
SELECT *
FROM tmdb
LIMIT 5;
"""

pd.read_sql(q, engine)

     imdb_id      revenue       budget certification
0  tt0118694   12855000.0     150000.0            PG
1  tt0120467      14904.0     120000.0             R
2  tt0120630  224835000.0   45000000.0             G
3  tt0120753     105983.0    8000000.0             R
4  tt0120755  546388000.0  125000000.0         PG-13

In [75]:
# ratings
ratings_df.to_sql('title_ratings', engine, dtype=ratings_schema, if_exists='replace',index=False)

q ="""
SELECT *
FROM title_ratings
LIMIT 5;
"""

pd.read_sql(q, engine)

      tconst  averageRating  numVotes
0  tt0000001            5.7      1905
1  tt0000002            5.8       256
2  tt0000003            6.5      1705
3  tt0000004            5.6       168
4  tt0000005            6.2      2519

In [76]:
# set primary keys
engine.execute('ALTER TABLE title_basics ADD PRIMARY KEY (`tconst`);')
engine.execute('ALTER TABLE tmdb ADD PRIMARY KEY (`imdb_id`);')
engine.execute('ALTER TABLE title_ratings ADD PRIMARY KEY (`tconst`);')

## Show Tables

In [78]:
q = """SHOW TABLES;"""
pd.read_sql(q, engine)

  Tables_in_movies
0     genre_lookup
1     title_basics
2     title_genres
3    title_ratings
4             tmdb